ZiGaMi/nRF5_nRF52840_DevBoard/src/drivers/peripheral/ble/ble_p.c
#ifndef DEBUG
    #undef BLE_P_DEBUG_EN
    #define BLE_P_DEBUG_EN 0
#endif

/**
 *  Enable/Disable assertion
 *
 *  @note   Disble in release!
 */
 #define BLE_P_ASSERT_EN                            ( 1 )

#ifndef DEBUG
    #undef PAR_CFG_ASSERT_EN
    #define PAR_CFG_ASSERT_EN 0
#endif

/**
 * 	Debug communication port macros
 */
#if ( 1 == BLE_P_DEBUG_EN )
	#define BLE_P_DBG_PRINT( ... )                  ( cli_printf( __VA_ARGS__ ))
#else
	#define BLE_P_DBG_PRINT( ... )                  { ; }

#endif

/**
 *  Assertion definition
 */
 #if ( BLE_P_ASSERT_EN )
	#define BLE_P_ASSERT(x)                         { PROJECT_CONFIG_ASSERT(x) }
 #else
  #define BLE_P_ASSERT)                             { ; }
 #endif

/**
 *  Invalid configuration catcher
 */

 // Min. connection interval must be smaller than max.
 _Static_assert( BLE_P_MIN_CONN_INTERVAL_MS < BLE_P_MAX_CONN_INTERVAL_MS );

// Slave lateny must be in valid range
_Static_assert(( BLE_P_SLAVE_LATENCY >= 0) && ( BLE_P_SLAVE_LATENCY < 500 ));

// Supervision timeout must be in valid range
_Static_assert(( BLE_P_SUPERVISION_TIMEOUT_MS >= 100) && ( BLE_P_SUPERVISION_TIMEOUT_MS <= 32000 ));

// Supervision timeout additional condition must be meet
_Static_assert( BLE_P_SUPERVISION_TIMEOUT_MS > (( 1 + BLE_P_SLAVE_LATENCY ) * 2 * BLE_P_MAX_CONN_INTERVAL_MS ));

// Advertisement interval must be in valid range
_Static_assert(( BLE_P_ADV_INTERVAL_MS >= 20) && ( BLE_P_ADV_INTERVAL_MS <= 10240 ));


////////////////////////////////////////////////////////////////////////////////
// Variables
////////////////////////////////////////////////////////////////////////////////

/**
 *      Initialization guards
 */
static bool gb_is_init = false;

/**
 *      Reception buffer space
 */
static uint8_t gu8_ble_rx_buffer[BLE_P_RX_BUF_SIZE] = {0};

/**
 *      UART Rx buffer
 */
static p_ring_buffer_t 		g_rx_buf = NULL;
const ring_buffer_attr_t 	g_rx_buf_attr = 
{ 	
    .name 		= "BLE Peripheral Rx Buf",
    .item_size 	= sizeof(uint8_t),
    .override 	= false,
    .p_mem 		= &gu8_ble_rx_buffer 
};

/**
 *      BLE Peripheral data
 */
static ble_p_data_t g_ble_p = 
{ 
    .conn_handle    = BLE_CONN_HANDLE_INVALID,
    .is_adv         = false,


};  
    
/**
 *      Define GATT instance
 *
 *  @note   Calling this macro also register observer in background!
 */
NRF_BLE_GATT_DEF( g_gatt_instance );

/**
 *      Define Advertising instance
 *
 *  @note   Calling this macro also register observer in background!
 */ 
BLE_ADVERTISING_DEF( g_adv_instance );

/**
 *      Declare Queued Write instance
 *
 *  @brief  The Queued Writes module provides an implementation of 
 *          Queued Writes, using the Generic Attribute Profile (GATT) 
 *          Server interface of the SoftDevice. Add this module to your 
 *          GATT server implementation to enable support for Queued Writes 
 *          for some or all of the characteristics.
 *
 *  @note   Calling this macro also register observer in background!
 *
 *  @note   Leave this as it might come handy in future....
 */
//NRF_BLE_QWR_DEF( g_qwr_instance );




/**
 *      Serial characteristics
 */
static ble_p_char_t g_ble_p_serial_chars[eBLE_P_SER_CHAR_NUM_OF] = 
{
    // ----------------------------------------------------------------------------------------------------------------------------------------------------
    //                          Char handle     Char UUID                       Char property
    // ----------------------------------------------------------------------------------------------------------------------------------------------------
    [eBLE_P_SER_CHAR_TX] = {    .handle = 0,    .uuid = BLE_P_CHAR_TX_UUID,     .property = ( eBLE_P_CHAR_PROP_NOTIFY | eBLE_P_CHAR_PROP_READ )     },
    [eBLE_P_SER_CHAR_RX] = {    .handle = 0,    .uuid = BLE_P_CHAR_RX_UUID,     .property = ( eBLE_P_CHAR_PROP_WRITE )                              },
};

/**
 *      Device info characteristics
 */
static ble_p_char_t g_ble_p_dev_info_chars[eBLE_P_DEV_CHAR_NUM_OF] = 
{
    // ----------------------------------------------------------------------------------------------------------------------------------------------------
    //                                  Char handle     Char UUID                               Char property
    // ----------------------------------------------------------------------------------------------------------------------------------------------------
    [eBLE_P_DEV_CHAR_DEV_NAME]      = {  .handle = 0,   .uuid = BLE_P_CHAR_DEV_NAME_UUID,       .property = ( eBLE_P_CHAR_PROP_READ )               },
    [eBLE_P_DEV_CHAR_FW_VER]        = {  .handle = 0,   .uuid = BLE_P_CHAR_FW_VER_UUID,         .property = ( eBLE_P_CHAR_PROP_READ )               },
    [eBLE_P_DEV_CHAR_HW_VER]        = {  .handle = 0,   .uuid = BLE_P_CHAR_HW_VER_UUID,         .property = ( eBLE_P_CHAR_PROP_READ )               },
    [eBLE_P_DEV_CHAR_SERIAL_NUM]    = {  .handle = 0,   .uuid = BLE_P_CHAR_SER_NUM_UUID,        .property = ( eBLE_P_CHAR_PROP_READ )               },
    [eBLE_P_DEV_CHAR_MAN_NAME]      = {  .handle = 0,   .uuid = BLE_P_CHAR_MAN_NAME_UUID,       .property = ( eBLE_P_CHAR_PROP_READ )               },
};

/**
 *      BLE Services
 */
static ble_p_service_t g_ble_p_service[ eBLE_P_SERVICE_NUM_OF ] =
{
    // -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    //                              UUID 16-bit                                         UUID 128-bit                                Service characteristics                                     Number of characteristics
    // -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    [ eBLE_P_SERVICE_SERIAL ]   = { .uuid_16.uuid = BLE_P_SERVICE_SERIAL_UUID_16,    .uuid_128 = BLE_P_SERVICE_SERIAL_UUID_BASE,     .p_char = (ble_p_char_t*) &g_ble_p_serial_chars,       .char_num_of = eBLE_P_SER_CHAR_NUM_OF        },
    [ eBLE_P_SERVICE_DEV_INFO ] = { .uuid_16.uuid = BLE_P_SERVICE_DEV_INFO_UUID,     .uuid_128 = {0},                                .p_char = (ble_p_char_t*) &g_ble_p_dev_info_chars,     .char_num_of = eBLE_P_DEV_CHAR_NUM_OF        },
};












// Available services as it will be part of advertisement packet
static ble_uuid_t m_adv_uuids[] = 
{ 
    {   .uuid = BLE_UUID_HEALTH_THERMOMETER_SERVICE,    .type = BLE_UUID_TYPE_BLE  },   // SIG standard service
    {   .uuid = BLE_UUID_BATTERY_SERVICE,               .type = BLE_UUID_TYPE_BLE  },   // SIG standard service
};



//static ble_gatts_char_handles_t    char_handles    = {0};

#define THERMOSTAT_SERVICE_BASE                                                \
  {                                                                            \
    0x2A, 0x94, 0x01, 0x0a, 0x34, 0xc4, 0x3e, 0xbc, 0xe5, 0x4b, 0xb3, 0x8b,    \
        0x00, 0x00, 0x9d, 0xaf                                                 \
  }

#define THERMOSTAT_SERVICE_UUID   0x1000


#define BLE_THERMOSTAT_RX_CHARACTERISTIC   0x1001
#define BLE_THERMOSTAT_TX_CHARACTERISTIC   0x1002

static ble_gatts_char_handles_t    rx_char_handles    = {0};
static ble_gatts_char_handles_t    tx_char_handles    = {0};




////////////////////////////////////////////////////////////////////////////////
// Function prototypes
////////////////////////////////////////////////////////////////////////////////
static ble_p_status_t   ble_p_stack_init            (void);
static void             ble_p_evt_hndl              (ble_evt_t const * p_ble_evt, void * p_context);
static inline void      ble_p_evt_on_connect        (ble_evt_t const * p_ble_evt);
static inline void      ble_p_evt_on_disconnect     (ble_evt_t const * p_ble_evt);
static inline void      ble_p_evt_on_write          (ble_evt_t const * p_ble_evt);
static inline void      ble_p_evt_on_update_phy     (ble_evt_t const * p_ble_evt);
static inline void      ble_p_evt_on_missing_attr   (ble_evt_t const * p_ble_evt);
static ble_p_status_t   ble_p_gap_init              (void);
static ble_p_status_t   ble_p_gatt_init             (void);
static void             ble_p_adv_evt_hndl          (ble_adv_evt_t ble_adv_evt);
static ble_p_status_t   ble_p_adv_init              (void);
static ble_p_status_t   ble_p_conn_init             (void);
static void             ble_p_on_conn_pars_evt_hndl (ble_conn_params_evt_t * p_evt);
static ble_p_status_t   ble_p_serv_char_init        (void);




////////////////////////////////////////////////////////////////////////////////
// Functions
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
/**
*		Initialize BLE peripheral stack
*
* @return 		status - Status of initialization
*/
////////////////////////////////////////////////////////////////////////////////
static ble_p_status_t ble_p_stack_init(void)
{
    ble_p_status_t  status      = eBLE_P_OK;
    uint32_t        ram_start   = 0;  // Application RAM start address

    // Start SoftDevice
    if ( NRF_SUCCESS != nrf_sdh_enable_request())
    {
        status = eBLE_P_ERROR;
        
        BLE_P_DBG_PRINT( "BLE_P: SoftDevice enable request error!" );
    }

    // Configure BLE stack
    if ( NRF_SUCCESS != nrf_sdh_ble_default_cfg_set( BLE_P_CONN_CFG_TAG, &ram_start ))
    {
        status = eBLE_P_ERROR;
        
        BLE_P_DBG_PRINT( "BLE_P: SoftDevice default config set error!" );
    }

