ZiGaMi/nRF5_nRF52840_DevBoard/src/drivers/peripheral/ble/ble_p.c
    // Enable BLE stack
    if ( NRF_SUCCESS != nrf_sdh_ble_enable( &ram_start ))
    {
        status = eBLE_P_ERROR;
        
        BLE_P_DBG_PRINT( "BLE_P: SoftDevice enable error!" );
    }
    
    // Register BLE event callback
    // An observer is essentially a piece of code that listens for events.
    NRF_SDH_BLE_OBSERVER( m_ble_observer, BLE_P_EVENT_PRIORITY, ble_p_evt_hndl, NULL );

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/**
*		Main BLE event handler
*
* @param[in] 	p_ble_evt   - Pointer to BLE event informations
* @param[in] 	p_context   - Pointer to context
* @return 		void
*/
////////////////////////////////////////////////////////////////////////////////
static void ble_p_evt_hndl(ble_evt_t const * p_ble_evt, void * p_context)
{
    // Handle BLE events
    switch( p_ble_evt->header.evt_id )
    {
        /**
         *      Disconnected from peer event
         */
        case BLE_GAP_EVT_DISCONNECTED:
            ble_p_evt_on_disconnect( p_ble_evt );
            break;

        /**
         *      Connected to peer event
         */
        case BLE_GAP_EVT_CONNECTED:
            ble_p_evt_on_connect( p_ble_evt );
            break;

        /**
         *      PHY Update Procedure is complete
         *
         * @note    This event must be handler in order not to lose connection 
         *          with peer. If this event is not handled the connection
         *          will timeout.
         *
         *          Further details: https://infocenter.nordicsemi.com/index.jsp?topic=%2Fcom.nordic.infocenter.s132.api.v7.2.0%2Fgroup___b_l_e___g_a_p___p_e_r_i_p_h_e_r_a_l___p_h_y___u_p_d_a_t_e.html&cp=4_7_3_1_2_1_5_7_1
         */
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
            ble_p_evt_on_update_phy( p_ble_evt );
            break;

        /**
         *      A persistent system attribute access is pending
         *
         * @note    This event is triggered if the peer request a read on any of the
         *          system attributes
         *
         *          In the case where you send indications or notifications before the peer requests 
         *          such a read, for instance you want to perform a "sd_ble_gatts_service_changed()", 
         *          you need to do "the sd_ble_gatts_sys_attr_set()" first.
         *
         *          Furhter details: https://devzone.nordicsemi.com/f/nordic-q-a/54039/why-don-t-i-get-a-ble_gatts_evt_sys_attr_missing-event
         */
        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            ble_p_evt_on_missing_attr( p_ble_evt );
            break;

        /**
         *      Write operation performed
         */
        case BLE_GATTS_EVT_WRITE:
            ble_p_evt_on_write( p_ble_evt );
            break;

        default:
            // No actions...
            break;
    }
}

////////////////////////////////////////////////////////////////////////////////
/**
*		BLE on connect event handler 
*
* @note     This function is being executed in main BLE stack callback!
*
* @param[in] 	p_ble_evt   - Pointer to BLE event informations
* @return 		void
*/
////////////////////////////////////////////////////////////////////////////////
static inline void ble_p_evt_on_connect(ble_evt_t const * p_ble_evt)
{
    // Assing connection info to handle
    g_ble_p.conn_handle = p_ble_evt->evt.gap_evt.conn_handle;

    // Stop advertisement
    // NOTE: This is done automatically by BLE SDK library!
    //(void) ble_p_adv_stop();

    // Raise callback
    ble_p_evt_cb( eBLE_P_EVT_CONNECT );

    BLE_P_DBG_PRINT( "BLE_P: Connected!" );
}

////////////////////////////////////////////////////////////////////////////////
/**
*		BLE on disconnect event handler 
*
* @note     This function is being executed in main BLE stack callback!
*
* @param[in] 	p_ble_evt   - Pointer to BLE event informations
* @return 		void
*/
////////////////////////////////////////////////////////////////////////////////
static inline void ble_p_evt_on_disconnect(ble_evt_t const * p_ble_evt)
{
    // Connection lost
    g_ble_p.conn_handle = BLE_CONN_HANDLE_INVALID;

    // Raise callback
    ble_p_evt_cb( eBLE_P_EVT_DISCONNECT );

    BLE_P_DBG_PRINT( "BLE_P: Disconnected!" );

    #if ( 1 == BLE_P_START_ADV_ON_DISCONNECT )

        // Start advertisement
        (void) ble_p_adv_start();

    #endif  
}

////////////////////////////////////////////////////////////////////////////////
/**
*		BLE on write event handler 
*
* @note     This function is being executed in main BLE stack callback!
*
* @param[in] 	p_ble_evt   - Pointer to BLE event informations
* @return 		void
*/
////////////////////////////////////////////////////////////////////////////////
static inline void ble_p_evt_on_write(ble_evt_t const * p_ble_evt)
{
    // Client write to RX characteristics?
    if ( p_ble_evt->evt.gatts_evt.params.write.handle == g_ble_p_service[eBLE_P_SERVICE_SERIAL].p_char[eBLE_P_SER_CHAR_RX].handle.value_handle )
    {
        // Get data and lenght
        const uint8_t * p_data  = p_ble_evt->evt.gatts_evt.params.write.data;
        const uint16_t len      = p_ble_evt->evt.gatts_evt.params.write.len;

        // Debug message
        BLE_P_DBG_PRINT( "BLE_P: Rx event! (len: %d)", len );

        // Add to RX fifo
        for (uint16_t idx = 0; idx < len; idx++)
        {
            if ( eRING_BUFFER_OK != ring_buffer_add( g_rx_buf, (uint8_t*) &p_data[idx] ))
            {
                // Buffer overflow!
                BLE_P_DBG_PRINT( "BLE_P: Rx buffer overflow! Increse buffer size via \"BLE_P_RX_BUF_SIZE\" macro!");

                break;
            }
        }

        // Raise callback
        ble_p_evt_cb( eBLE_P_EVT_RX_DATA ); 
    }
}

////////////////////////////////////////////////////////////////////////////////
/**
*		BLE on update of PHY event handler 
*
* @note     This function is being executed in main BLE stack callback!
*
* @param[in] 	p_ble_evt   - Pointer to BLE event informations
* @return 		void
*/
////////////////////////////////////////////////////////////////////////////////
static inline void ble_p_evt_on_update_phy(ble_evt_t const * p_ble_evt)
{
    // Set to auto option for PHY
    const ble_gap_phys_t phys = 
    {
        .rx_phys = BLE_GAP_PHY_AUTO,
        .tx_phys = BLE_GAP_PHY_AUTO,
    };

