ZiGaMi/nRF5_nRF52840_DevBoard/src/drivers/peripheral/ble/ble_p.c
    // Init BLE connection library
    if ( NRF_SUCCESS != ble_conn_params_init( &conn_par_init ))
    {
        status = eBLE_P_ERROR;

        BLE_P_DBG_PRINT( "BLE_P: BLE connection parameters library init error!" );
        BLE_P_ASSERT( 0 );
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/**
 * @brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *
 * @note    All this function does is to disconnect. This could have been done by simply
 *          setting the disconnect_on_fail config parameter, but instead we use the event
 *          handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
 ////////////////////////////////////////////////////////////////////////////////
static void ble_p_on_conn_pars_evt_hndl(ble_conn_params_evt_t * p_evt)
{
    // Negotiation procedure failed
    if ( BLE_CONN_PARAMS_EVT_FAILED == p_evt->evt_type )
    {
        if ( NRF_SUCCESS != sd_ble_gap_disconnect( g_ble_p.conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE ))
        {
            // TODO: How to handle this error?

            BLE_P_DBG_PRINT( "BLE_P: Disconnection error! (sd_ble_gap_disconnect)" );
            BLE_P_ASSERT( 0 );
        }
    }
}


static inline bool ble_p_is_uuid_vendor(const uint8_t * const p_uuid128)
{
    bool is_vendor_specific = false;
    
    // If non-zero value is found deduce that is vendor specific UUID
    for ( uint8_t byte = 0; byte < 16; byte++)
    {
        if ( 0x00 != p_uuid128[byte] )
        {
            is_vendor_specific = true;
            break;
        }
    }

    return is_vendor_specific;
}


static ble_p_status_t ble_p_serv_init(ble_p_service_t * const p_serv)
{
    ble_p_status_t status = eBLE_P_OK;

    // If using Vendor specific UUID
    if ( true == ble_p_is_uuid_vendor((const uint8_t*) &p_serv->uuid_128.uuid128 ))
    {
        // Add Vendor specific UUID
        if ( NRF_SUCCESS != sd_ble_uuid_vs_add( &p_serv->uuid_128, &p_serv->uuid_16.type ))
        {
            status = eBLE_P_ERROR;

            BLE_P_DBG_PRINT( "BLE_P: Adding vendor specific UUID error!" ); 
            BLE_P_ASSERT( 0 );
        }
    }

    // BLE standard service
    else
    {
        p_serv->uuid_16.type = BLE_UUID_TYPE_BLE;
    }

    // Register service
    if ( NRF_SUCCESS != sd_ble_gatts_service_add( BLE_GATTS_SRVC_TYPE_PRIMARY, &p_serv->uuid_16, &p_serv->handle ))  
    {
        status = eBLE_P_ERROR;

        BLE_P_DBG_PRINT( "BLE_P: Adding GATTS service error!" ); 
        BLE_P_ASSERT( 0 );
    } 

    return status;
}


static ble_p_status_t ble_p_char_init(ble_p_char_t * const p_char, const uint16_t service_handle, const uint8_t uuid_type)
{
    ble_p_status_t          status      = eBLE_P_OK;
    ble_add_char_params_t   char_param  = {0};

    // Setup characteristics parameters
    char_param.uuid                     = p_char->uuid;
    char_param.uuid_type                = uuid_type;
    char_param.init_len                 = 0;
    char_param.max_len                  = 250;      // TODO: Add define...
    char_param.is_var_len               = true;
    char_param.read_access              = SEC_OPEN;
    char_param.write_access             = SEC_OPEN;
    char_param.cccd_write_access        = SEC_OPEN;
    
    // Write access
    if ( p_char->property & eBLE_P_CHAR_PROP_WRITE )
    {
        char_param.char_props.write         = 1;
        char_param.char_props.write_wo_resp = 1;
    }

    // Read access
    if ( p_char->property & eBLE_P_CHAR_PROP_READ )
    {
        char_param.char_props.read = 1;
    }

    // Notify enabled
    if ( p_char->property & eBLE_P_CHAR_PROP_NOTIFY )
    {
        char_param.char_props.notify = 1;
    }

    // Register characteristics to SoftDevice
    if ( NRF_SUCCESS != characteristic_add( service_handle, &char_param, &p_char->handle ))
    {
        status = eBLE_P_ERROR;

        BLE_P_DBG_PRINT( "BLE_P: Adding characteristics error!" );
        BLE_P_ASSERT( 0 );
    }

    return status;
}


static ble_p_status_t ble_p_serv_char_init(void)
{
    ble_p_status_t status = eBLE_P_OK;
    
    

    status |= ble_p_serv_init( &g_ble_p_service[eBLE_P_SERVICE_SERIAL] );


    status |= ble_p_char_init( &g_ble_p_service[eBLE_P_SERVICE_SERIAL].p_char[eBLE_P_SER_CHAR_RX], g_ble_p_service[eBLE_P_SERVICE_SERIAL].handle, g_ble_p_service[eBLE_P_SERVICE_SERIAL].uuid_16.type );
    status |= ble_p_char_init( &g_ble_p_service[eBLE_P_SERVICE_SERIAL].p_char[eBLE_P_SER_CHAR_TX], g_ble_p_service[eBLE_P_SERVICE_SERIAL].handle, g_ble_p_service[eBLE_P_SERVICE_SERIAL].uuid_16.type );


    status |= ble_p_serv_init( &g_ble_p_service[eBLE_P_SERVICE_DEV_INFO] );



    #if 0
        if ( NRF_SUCCESS != sd_ble_uuid_vs_add( &g_ble_p_service[eBLE_P_SERVICE_SERIAL].uuid_128, &g_ble_p_service[eBLE_P_SERVICE_SERIAL].uuid_16.type ))
        {
            status = eBLE_P_ERROR;

            BLE_P_DBG_PRINT( "BLE_P: Adding vendor specific UUID error!" ); 
            BLE_P_ASSERT( 0 );
        }

        // Register service
        if ( NRF_SUCCESS != sd_ble_gatts_service_add( BLE_GATTS_SRVC_TYPE_PRIMARY, &g_ble_p_service[eBLE_P_SERVICE_SERIAL].uuid_16, &g_ble_p_service[eBLE_P_SERVICE_SERIAL].handle ))
        {
            status = eBLE_P_ERROR;

            BLE_P_DBG_PRINT( "BLE_P: Adding GATTS service error!" ); 
            BLE_P_ASSERT( 0 );
        }
    #endif

    
    



    #if 0
        // Add RX characteristics
        ble_add_char_params_t rx_char_params = {0};

        rx_char_params.uuid                     = BLE_P_CHAR_RX_UUID;
        rx_char_params.uuid_type                = char_uuid.type;
        rx_char_params.init_len                 = sizeof(uint8_t);
        rx_char_params.max_len                  = 250;
        rx_char_params.is_var_len               = true;
        rx_char_params.char_props.write         = 1;
        rx_char_params.char_props.write_wo_resp = 1;
        rx_char_params.read_access              = SEC_OPEN;
        rx_char_params.write_access             = SEC_OPEN;
        rx_char_params.cccd_write_access        = SEC_OPEN;

        // Register characteristics
        if ( NRF_SUCCESS != characteristic_add( custom_service_handle, &rx_char_params, &rx_char_handles ))
        {
            // TODO: Change error status...
            BLE_P_DBG_PRINT( "BLE_P: SoftDevice enable error!" ); 
        }

    
        // Add Tx characteristics
        ble_add_char_params_t tx_char_params = {0};

        tx_char_params.uuid                     = BLE_P_CHAR_TX_UUID;
        tx_char_params.uuid_type                = char_uuid.type;
        tx_char_params.init_len                 = sizeof(uint8_t);
        tx_char_params.max_len                  = 250;
        tx_char_params.is_var_len               = true;
        tx_char_params.char_props.write         = 0;
        tx_char_params.char_props.write_wo_resp = 0;
        tx_char_params.char_props.read          = 0;
        tx_char_params.char_props.notify        = 1;
        tx_char_params.read_access              = SEC_OPEN;
        tx_char_params.write_access             = SEC_OPEN;
        tx_char_params.cccd_write_access        = SEC_OPEN;

        // Register characteristics
        if ( NRF_SUCCESS != characteristic_add( custom_service_handle, &tx_char_params, &tx_char_handles))
        {
            // TODO: Change error status...
            BLE_P_DBG_PRINT( "BLE_P: SoftDevice enable error!" );
        }
    #endif

